RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32E50x_Firmware_Library/GD32E50x_standard_peripheral/Source/gd32e50x_rcu.c
    reg = RCU_ADDCFG;
    /* reset PLLUSBPRESEL and PLLUSBPREDV bits */
    reg &= ~(RCU_ADDCFG_PLLUSBPREDVSEL | RCU_ADDCFG_PLLUSBPREDV);
    /* set the PLLUSBPRESEL and PLLUSBPREDV division factor */
    reg |= (pllusbpredv_source | pllusbpredv_div);

    RCU_ADDCFG = reg;
}

/*!
    \brief      configure the PLLUSB clock
    \param[in]  pllusb_mul: PLLUSB clock multiplication factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLUSB_MULx (x = 16,17..127): PLLUSB source clock multiply by x
    \param[out] none
    \retval     none
*/
void rcu_pllusb_config(uint32_t pllusb_mul)
{
    RCU_ADDCFG &= ~RCU_ADDCFG_PLLUSBMF;
    RCU_ADDCFG |= pllusb_mul;
}

#endif /* GD32E50X_CL and GD32E508 */

/*!
    \brief      configure the ADC prescaler factor
    \param[in]  adc_psc: ADC prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKADC_CKAPB2_DIV2: ADC prescaler select CK_APB2 / 2
      \arg        RCU_CKADC_CKAPB2_DIV4: ADC prescaler select CK_APB2 / 4
      \arg        RCU_CKADC_CKAPB2_DIV6: ADC prescaler select CK_APB2 / 6
      \arg        RCU_CKADC_CKAPB2_DIV8: ADC prescaler select CK_APB2 / 8
      \arg        RCU_CKADC_CKAPB2_DIV12: ADC prescaler select CK_APB2 / 12
      \arg        RCU_CKADC_CKAPB2_DIV16: ADC prescaler select CK_APB2 / 16
      \arg        RCU_CKADC_CKAHB_DIV5: ADC prescaler select CK_AHB / 5
      \arg        RCU_CKADC_CKAHB_DIV6: ADC prescaler select CK_AHB / 6
      \arg        RCU_CKADC_CKAHB_DIV10: ADC prescaler select CK_AHB / 10
      \arg        RCU_CKADC_CKAHB_DIV20: ADC prescaler select CK_AHB / 20
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(uint32_t adc_psc)
{
    uint32_t reg0,reg1;

    /* reset the ADCPSC bits */
    reg0 = RCU_CFG0;
    reg0 &= ~(RCU_CFG0_ADCPSC_2 | RCU_CFG0_ADCPSC);
    reg1 = RCU_CFG1;
    reg1 &= ~RCU_CFG1_ADCPSC_3;

    /* set the ADC prescaler factor */
    switch(adc_psc)
    {
        case RCU_CKADC_CKAPB2_DIV2:
        case RCU_CKADC_CKAPB2_DIV4:
        case RCU_CKADC_CKAPB2_DIV6:
        case RCU_CKADC_CKAPB2_DIV8:
            reg0 |= (adc_psc << RCU_ADC_PSC_OFFSET);
            break;

        case RCU_CKADC_CKAPB2_DIV12:
        case RCU_CKADC_CKAPB2_DIV16:
            adc_psc &= ~BIT(2);
            reg0 |= ((adc_psc << RCU_ADC_PSC_OFFSET) | RCU_CFG0_ADCPSC_2);
            break;

        case RCU_CKADC_CKAHB_DIV5:
        case RCU_CKADC_CKAHB_DIV6:
        case RCU_CKADC_CKAHB_DIV10:
        case RCU_CKADC_CKAHB_DIV20:
            adc_psc &= ~BITS(2,3);
            reg0 |= (adc_psc << RCU_ADC_PSC_OFFSET);
            reg1 |= RCU_CFG1_ADCPSC_3;
            break;

        default:
            break;
    }

    /* set the register */
    RCU_CFG0 = reg0;
    RCU_CFG1 = reg1;
}

/*!
    \brief      configure the USBD/USBHS prescaler factor
    \param[in]  usb_psc: USB prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKUSB_CKPLL_DIV1_5: USBD / USBHS prescaler select CK_PLL / 1.5
      \arg        RCU_CKUSB_CKPLL_DIV1: USBD / USBHS prescaler select CK_PLL / 1
      \arg        RCU_CKUSB_CKPLL_DIV2_5: USBD / USBHS prescaler select CK_PLL / 2.5
      \arg        RCU_CKUSB_CKPLL_DIV2: USBD / USBHS prescaler select CK_PLL / 2
      \arg        RCU_CKUSB_CKPLL_DIV3: USBD / USBHS prescaler select CK_PLL / 3
      \arg        RCU_CKUSB_CKPLL_DIV3_5: USBD / USBHS prescaler select CK_PLL / 3.5
      \arg        RCU_CKUSB_CKPLL_DIV4: USBD / USBHS prescaler select CK_PLL / 4
    \param[out] none
    \retval     none
*/
void rcu_usb_clock_config(uint32_t usb_psc)
{
    uint32_t reg;

    reg = RCU_CFG0;

    /* configure the USBD/USBHS prescaler factor */
#if (defined(GD32E50X_HD) || defined(GD32EPRT))
    reg &= ~RCU_CFG0_USBDPSC;
#elif defined(GD32E50X_CL) || defined(GD32E508)
    reg &= ~RCU_CFG0_USBHSPSC;
#endif /* GD32E50X_HD and GD32EPRT */

    RCU_CFG0 = (reg | usb_psc);
}

/*!
    \brief      configure the RTC clock source selection
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC40K: CK_IRC40K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_128: CK_HXTAL/128 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = (reg | rtc_clock_source);
}

#ifndef GD32EPRT
/*!
    \brief      configure the SHRTIMER clock source selection
    \param[in]  shrtimer_clock_source: SHRTIMER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SHRTIMERSRC_CKAPB2: APB2 clock selected as SHRTIMER source clock
      \arg        RCU_SHRTIMERSRC_CKSYS: system clock selected as SHRTIMER source clock
    \param[out] none
    \retval     none
*/
void rcu_shrtimer_clock_config(uint32_t shrtimer_clock_source)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the I2S1SEL bit and set according to shrtimer_clock_source */
    reg &= ~RCU_CFG1_SHRTIMERSEL;
    RCU_CFG1 = (reg | shrtimer_clock_source);
}
#endif /* GD32EPRT */

/*!
    \brief      configure the USART5 clock source selection
    \param[in]  usart5_clock_source: USART5 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USART5SRC_CKAPB2: APB2 clock selected as USART5 source clock
      \arg        RCU_USART5SRC_CKSYS: system clock selected as USART5 source clock
      \arg        RCU_USART5SRC_LXTAL: LXTAL clock selected as USART5 source clock
      \arg        RCU_USART5SRC_IRC8M: IRC8M clock selected as USART5 source clock
    \param[out] none
    \retval     none
*/
void rcu_usart5_clock_config(uint32_t usart5_clock_source)
{
    uint32_t reg;
    reg = RCU_CFG2;
    /* reset the I2S1SEL bit and set according to usart5_clock_source */
    reg &= ~RCU_CFG2_USART5SEL;
    RCU_CFG2 = (reg | usart5_clock_source);
}

/*!
    \brief      configure the I2C2 clock source selection
    \param[in]  i2c2_clock_source: I2C2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2C2SRC_CKAPB1: APB1 clock selected as I2C2 source clock
      \arg        RCU_I2C2SRC_CKSYS: System clock selected as I2C2 source clock
      \arg        RCU_I2C2SRCSRC_CKIRC8M: CK_IRC8M clock selected as I2C2 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2c2_clock_config(uint32_t i2c2_clock_source)
{
    uint32_t reg;

    reg = RCU_CFG2;
    /* reset the I2S1SEL bit and set according to i2c2_clock_source */
    reg &= ~RCU_CFG2_I2C2SEL;
    RCU_CFG2 = (reg | i2c2_clock_source);
}

/*!
    \brief      configure the CK48M clock source selection
    \param[in]  ck48m_clock_source: CK48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK48MSRC_CKPLL: CK_PLL selected as CK48M source clock
      \arg        RCU_CK48MSRC_IRC48M: CK_IRC48M selected as CK48M source clock
      \arg        RCU_CK48MSRC_CKPLLUSB: (not available for EPRT series): CKPLLUSB selected as CK48M source clock
      \arg        RCU_CK48MSRC_CKPLL2: CKPLL2 selected as CK48M source clock
    \param[out] none
    \retval     none
*/
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the CK48MSEL bit and set according to ck48m_clock_source */
    reg &= ~RCU_ADDCTL_CK48MSEL;
    RCU_ADDCTL = (reg | ck48m_clock_source);
}

#if defined(GD32E50X_CL) || defined(GD32EPRT) || defined(GD32E508)
/*!
    \brief      configure the I2S1 clock source selection
    \param[in]  i2s_clock_source: I2S1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2S1SRC_CKSYS: system clock selected as I2S1 source clock
      \arg        RCU_I2S1SRC_CKPLL2_MUL2: CK_PLL2 * 2 selected as I2S1 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2s1_clock_config(uint32_t i2s_clock_source)
{
    uint32_t reg;

